* DataFrame选择列
    - `df['A']`, `df[['A', 'B', ...]]`
    - `df.A`
    - `df.loc[:, col]`
    - `df.loc[:, col1:col2]`
    - `df.loc[:, [col1, col2, col3]]`
    - `df.loc[:, boolean]`
    - df.iloc[:, pos1]
    - df.iloc[:, pos1:pos2]
    - df.iloc[:, [pos1, pos2, pos3]]
* DataFrame选择行
    - `df[m:n]`
    - `df[m:n:t]`
    - `df.loc[idx]`, `df.loc[idx, :]`
    - `df.loc[idx1:idx2]`, `df.loc[idx1:idx2, :]`
    - `df.loc[[idx1, idx3], :]`, `df.loc[[idx1, idx3]]`
    - `df.loc[boolean]``df.loc[boolean, :]`
    - df.iloc[pos], df.iloc[pos, :]
    - df.iloc[pos1:pos2], df.iloc[pos1:pos2, :]
    - df.iloc[[pos1, pos2, ...]], df.iloc[[pos1, pos2, ...], :]
* DataFrame选择子DataFrame
    - `df.loc[idx, col]`
    - `df.loc[idx1:idx2, col1:col2]`
    - `df.loc[[idx1, idx2], col1:col2]`
    - `df.loc[idx1:idx2, [col1, col2]]`
    - `df.loc[[idx1, idx2], [col1, col2]]`
    - `df.loc[boolean, boolean]`
    - df.iloc[pos, pos]
    - df.iloc[pos1:pos2, pos1:pos2]
    - df.iloc[[pos1, pos2, ...], [pos1, pos2, ...]]
* Series选择行
    - s[m]
    - s.idx
    - s['idx_name']
    - s[m:n]
    - s[m:n:t]
    - `s.loc[idx]`
    - `s.loc[idx1:idx2]`
    - `s.sort_index().loc[idx1:idx2]`
    - s.iloc[pos1]
    - s.iloc[pos1:pos2]

In [1]:
import numpy as np
import pandas as pd

# 索引访问`[]` => `__getitem__`

In [3]:
dates = pd.date_range('1/1/2000', periods = 8, freq = 'D')
df = pd.DataFrame(np.random.randn(8, 4), 
                  index = dates, 
                  columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -0.700357 -0.023085  0.377124  0.690618
2000-01-02 -0.261330  0.456513 -0.742383 -0.085439
2000-01-03  0.440801 -1.345019  0.131449  0.455163
2000-01-04 -0.794202 -0.388952  0.453211  0.502746
2000-01-05 -0.538715 -0.876613  0.927513  0.462744
2000-01-06 -2.345255  0.869346  0.126137 -0.344611
2000-01-07  0.429425 -1.782356  0.732238  1.830993
2000-01-08  0.489747  1.633026 -1.380645 -0.261789

In [19]:
panel = pd.Panel({
    'one': df,
    'two': df - df.mean()
})
panel

D:\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 8 (major_axis) x 4 (minor_axis)
Items axis: one to two
Major_axis axis: 2000-01-01 00:00:00 to 2000-01-08 00:00:00
Minor_axis axis: A to D

* pd.DateFrame['']
* pd.DateFrame[['', '', ...]]

In [13]:
s = df['A']
print(s)
print()
print(dates[5])
print()
print(s[dates[5]])

2000-01-01   -0.700357
2000-01-02   -0.261330
2000-01-03    0.440801
2000-01-04   -0.794202
2000-01-05   -0.538715
2000-01-06   -2.345255
2000-01-07    0.429425
2000-01-08    0.489747
Freq: D, Name: A, dtype: float64

2000-01-06 00:00:00

-2.3452554683097313

In [16]:
df[['B', 'A']] = df[['A', 'B']]
df

                   A         B         C         D
2000-01-01 -0.700357 -0.023085  0.377124  0.690618
2000-01-02 -0.261330  0.456513 -0.742383 -0.085439
2000-01-03  0.440801 -1.345019  0.131449  0.455163
2000-01-04 -0.794202 -0.388952  0.453211  0.502746
2000-01-05 -0.538715 -0.876613  0.927513  0.462744
2000-01-06 -2.345255  0.869346  0.126137 -0.344611
2000-01-07  0.429425 -1.782356  0.732238  1.830993
2000-01-08  0.489747  1.633026 -1.380645 -0.261789

In [17]:
df.loc[:, ['B', 'A']]  = df[['A', 'B']]
df[['A', 'B']]

                   A         B
2000-01-01 -0.700357 -0.023085
2000-01-02 -0.261330  0.456513
2000-01-03  0.440801 -1.345019
2000-01-04 -0.794202 -0.388952
2000-01-05 -0.538715 -0.876613
2000-01-06 -2.345255  0.869346
2000-01-07  0.429425 -1.782356
2000-01-08  0.489747  1.633026

In [18]:
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()
df[['A', 'B']]

                   A         B
2000-01-01 -0.023085 -0.700357
2000-01-02  0.456513 -0.261330
2000-01-03 -1.345019  0.440801
2000-01-04 -0.388952 -0.794202
2000-01-05 -0.876613 -0.538715
2000-01-06  0.869346 -2.345255
2000-01-07 -1.782356  0.429425
2000-01-08  1.633026  0.489747

# 属性访问

In [22]:
sa = pd.Series([1, 2, 3], index = list('abc'))
dfa = df.copy()

In [23]:
sa.b

2

In [24]:
dfa.A

2000-01-01   -0.023085
2000-01-02    0.456513
2000-01-03   -1.345019
2000-01-04   -0.388952
2000-01-05   -0.876613
2000-01-06    0.869346
2000-01-07   -1.782356
2000-01-08    1.633026
Freq: D, Name: A, dtype: float64

In [25]:
panel.two

                   A         B         C         D
2000-01-01  0.159058 -0.290371  0.299043  0.284315
2000-01-02  0.638655  0.148656 -0.820464 -0.491742
2000-01-03 -1.162876  0.850787  0.053368  0.048860
2000-01-04 -0.206810 -0.384216  0.375130  0.096443
2000-01-05 -0.694471 -0.128729  0.849433  0.056441
2000-01-06  1.051488 -1.935270  0.048057 -0.750914
2000-01-07 -1.600213  0.839410  0.654158  1.424690
2000-01-08  1.815169  0.899732 -1.458725 -0.668092

# 切片

* Series[:]
* Series[:::]
* DataFrame[:]
* DataFrame[::]

In [33]:
s

2000-01-01   -0.023085
2000-01-02    0.456513
2000-01-03   -1.345019
2000-01-04   -0.388952
2000-01-05   -0.876613
2000-01-06    0.869346
2000-01-07   -1.782356
2000-01-08    1.633026
Freq: D, Name: A, dtype: float64

In [27]:
s[:5]

2000-01-01   -0.023085
2000-01-02    0.456513
2000-01-03   -1.345019
2000-01-04   -0.388952
2000-01-05   -0.876613
Freq: D, Name: A, dtype: float64

In [28]:
s[::2]

2000-01-01   -0.023085
2000-01-03   -1.345019
2000-01-05   -0.876613
2000-01-07   -1.782356
Freq: 2D, Name: A, dtype: float64

In [29]:
s[::-1]

2000-01-08    1.633026
2000-01-07   -1.782356
2000-01-06    0.869346
2000-01-05   -0.876613
2000-01-04   -0.388952
2000-01-03   -1.345019
2000-01-02    0.456513
2000-01-01   -0.023085
Freq: -1D, Name: A, dtype: float64

In [30]:
df[:3]

                   A         B         C         D
2000-01-01 -0.023085 -0.700357  0.377124  0.690618
2000-01-02  0.456513 -0.261330 -0.742383 -0.085439
2000-01-03 -1.345019  0.440801  0.131449  0.455163

In [31]:
df[::-1]

                   A         B         C         D
2000-01-08  1.633026  0.489747 -1.380645 -0.261789
2000-01-07 -1.782356  0.429425  0.732238  1.830993
2000-01-06  0.869346 -2.345255  0.126137 -0.344611
2000-01-05 -0.876613 -0.538715  0.927513  0.462744
2000-01-04 -0.388952 -0.794202  0.453211  0.502746
2000-01-03 -1.345019  0.440801  0.131449  0.455163
2000-01-02  0.456513 -0.261330 -0.742383 -0.085439
2000-01-01 -0.023085 -0.700357  0.377124  0.690618

# Selection By Label

#### DataFrame with Datetime index

In [81]:
df1 = pd.DataFrame(np.random.randn(5, 4), 
                   columns = list('ABCD'),
                   index = pd.date_range('20130101', periods = 5, freq = 'D'))
df1

                   A         B         C         D
2013-01-01 -0.354722 -1.923728  1.976339  0.129871
2013-01-02  1.525818  0.219340 -0.288649 -2.034759
2013-01-03 -1.589549 -0.050532  0.559865  0.730954
2013-01-04  0.720532  0.811010 -1.492413  2.263404
2013-01-05  0.039209 -1.398068  0.806302  0.300870

In [82]:
try:
    df1.loc[2:3]
except:
    print("Error")

Error

In [83]:
df1.loc['20130102']

A    1.525818
B    0.219340
C   -0.288649
D   -2.034759
Name: 2013-01-02 00:00:00, dtype: float64

In [84]:
df1.loc['20130102', :]

A    1.525818
B    0.219340
C   -0.288649
D   -2.034759
Name: 2013-01-02 00:00:00, dtype: float64

In [85]:
df1.loc['20130102':'20130104', :]

                   A         B         C         D
2013-01-02  1.525818  0.219340 -0.288649 -2.034759
2013-01-03 -1.589549 -0.050532  0.559865  0.730954
2013-01-04  0.720532  0.811010 -1.492413  2.263404

In [92]:
# df1.loc[['2013-01-02', '2013-01-04', '2013-01-05'], :]

In [37]:
df1.loc['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.405488 -0.240855  0.359263 -0.307247
2013-01-03  1.698013  1.753987 -1.002604 -0.328292
2013-01-04 -1.418603  0.053742  0.306062  0.808014

In [74]:
df1.loc[:,'A']

2013-01-01   -2.113286
2013-01-02   -1.405488
2013-01-03    1.698013
2013-01-04   -1.418603
2013-01-05    0.083651
Freq: D, Name: A, dtype: float64

In [95]:
df1.loc[:, 'A':'C']

                   A         B         C
2013-01-01 -0.354722 -1.923728  1.976339
2013-01-02  1.525818  0.219340 -0.288649
2013-01-03 -1.589549 -0.050532  0.559865
2013-01-04  0.720532  0.811010 -1.492413
2013-01-05  0.039209 -1.398068  0.806302

In [96]:
df1.loc[:, ['A', 'D', 'C']]

                   A         D         C
2013-01-01 -0.354722  0.129871  1.976339
2013-01-02  1.525818 -2.034759 -0.288649
2013-01-03 -1.589549  0.730954  0.559865
2013-01-04  0.720532  2.263404 -1.492413
2013-01-05  0.039209  0.300870  0.806302

In [93]:
df1.loc['20130102':'20130104', 'A':'C']

                   A         B         C
2013-01-02  1.525818  0.219340 -0.288649
2013-01-03 -1.589549 -0.050532  0.559865
2013-01-04  0.720532  0.811010 -1.492413

In [97]:
df1.loc['20130102':'20130104', ['A', 'D', 'C']]

                   A         D         C
2013-01-02  1.525818 -2.034759 -0.288649
2013-01-03 -1.589549  0.730954  0.559865
2013-01-04  0.720532  2.263404 -1.492413

In [100]:
# df1.loc[['20130102', '20130104', '20130101'], ['A', 'C', 'D']]

#### Series

In [76]:
s1 = pd.Series(np.random.randn(6), index = list('abcdef'))
s1

a   -0.879865
b    0.424351
c   -1.052348
d   -0.600336
e    0.243726
f   -0.550512
dtype: float64

In [78]:
s1.loc['c':]

c   -1.052348
d   -0.600336
e    0.243726
f   -0.550512
dtype: float64

In [88]:
s1.loc['c']

-1.052348084281969

#### DataFrame with normal index

In [101]:
df2 = pd.DataFrame(np.random.randn(6, 4), index = list('abcdef'), columns = list('ABCD'))
df2

          A         B         C         D
a  0.539614 -2.085452 -0.387480  1.612251
b  0.226549  0.782611 -1.295687  0.416662
c  0.138371 -0.095452  0.245354 -0.251030
d -1.030707  0.322914 -0.083806  0.206761
e  1.435039 -0.248517 -0.762502  1.372238
f -1.222409  0.319962  0.612967 -0.886375

In [106]:
df2.loc['a'], df2.loc['a', :]
df2.loc['a':'e', :]
df2.loc[['a', 'e', 'f'], :]

df2.loc[:, 'A']
df2.loc[:, 'A':'B']
df2.loc[:, ['A', 'C', 'D']]

          A         C         D
a  0.539614 -0.387480  1.612251
b  0.226549 -1.295687  0.416662
c  0.138371  0.245354 -0.251030
d -1.030707 -0.083806  0.206761
e  1.435039 -0.762502  1.372238
f -1.222409  0.612967 -0.886375

#### bool indexing

In [112]:
df2.loc['a', :] > 0

A     True
B    False
C    False
D     True
Name: a, dtype: bool

In [113]:
df2.loc[:, df2.loc['a'] > 0]

          A         D
a  0.539614  1.612251
b  0.226549  0.416662
c  0.138371 -0.251030
d -1.030707  0.206761
e  1.435039  1.372238
f -1.222409 -0.886375

# Selection By Position

#### Series

In [114]:
s1 = pd.Series(np.random.randn(5), 
               index = list(range(0, 10, 2)))
s1

0   -0.641168
2    1.273565
4    0.265654
6    1.062376
8   -0.416196
dtype: float64

In [117]:
s1.iloc[1]

1.2735654873490818

In [118]:
s1.iloc[0:3]

0   -0.641168
2    1.273565
4    0.265654
dtype: float64

#### DataFrame

In [119]:
df1 = pd.DataFrame(np.random.randn(6, 4), 
                   index = list(range(0, 12, 2)),
                   columns = list(range(0, 8, 2)))
df1

           0         2         4         6
0   0.277355  1.170329 -0.216728 -0.491426
2   1.102692  1.541183  0.380077 -3.015055
4  -0.610160  0.794926  1.228155 -0.727703
6   0.499212  1.775840  0.926014 -0.750819
8   1.615997  0.330519 -0.191336  0.067967
10  0.398877  0.771205 -0.093476  0.307660

In [121]:
df1.iloc[0]

0    0.277355
2    1.170329
4   -0.216728
6   -0.491426
Name: 0, dtype: float64

In [122]:
df1.iloc[0, :]

0    0.277355
2    1.170329
4   -0.216728
6   -0.491426
Name: 0, dtype: float64

In [123]:
df1.iloc[0:3]

          0         2         4         6
0  0.277355  1.170329 -0.216728 -0.491426
2  1.102692  1.541183  0.380077 -3.015055
4 -0.610160  0.794926  1.228155 -0.727703

In [131]:
df1.iloc[0:3, :]

          0         2         4         6
0  0.277355  1.170329 -0.216728 -0.491426
2  1.102692  1.541183  0.380077 -3.015055
4 -0.610160  0.794926  1.228155 -0.727703

In [133]:
df1.iloc[[2, 0, 1]]

          0         2         4         6
4 -0.610160  0.794926  1.228155 -0.727703
0  0.277355  1.170329 -0.216728 -0.491426
2  1.102692  1.541183  0.380077 -3.015055

In [132]:
df1.iloc[[2, 0, 1], :]

          0         2         4         6
4 -0.610160  0.794926  1.228155 -0.727703
0  0.277355  1.170329 -0.216728 -0.491426
2  1.102692  1.541183  0.380077 -3.015055

In [125]:
df1.iloc[:, 3]

0    -0.491426
2    -3.015055
4    -0.727703
6    -0.750819
8     0.067967
10    0.307660
Name: 6, dtype: float64

In [134]:
df1.iloc[:, 2:3]

           4
0  -0.216728
2   0.380077
4   1.228155
6   0.926014
8  -0.191336
10 -0.093476

In [136]:
df1.iloc[:, [0, 1, 3]]

           0         2         6
0   0.277355  1.170329 -0.491426
2   1.102692  1.541183 -3.015055
4  -0.610160  0.794926 -0.727703
6   0.499212  1.775840 -0.750819
8   1.615997  0.330519  0.067967
10  0.398877  0.771205  0.307660

In [130]:
df1.iloc[1:5, 2:4]

          4         6
2  0.380077 -3.015055
4  1.228155 -0.727703
6  0.926014 -0.750819
8 -0.191336  0.067967

In [137]:
df.iloc[[0, 3, 2], [0, 2, 1]]

          A         C         B
a  0.903444 -0.666687  0.641825
d -0.889497 -0.076937  1.469473
c  0.234372 -1.302702  1.422947

# Selection By Callable